vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7128.h
#define          PLLBASE                                    (*(volatile unsigned long      *) 0xFFFF0400)
#define          POWKEY1                                    (*(volatile unsigned long      *) 0xFFFF0404)
#define          POWCON                                     (*(volatile unsigned long      *) 0xFFFF0408)
#define          POWKEY2                                    (*(volatile unsigned long      *) 0xFFFF040C)
#define          PLLKEY1                                    (*(volatile unsigned long      *) 0xFFFF0410)
#define          PLLCON                                     (*(volatile unsigned long      *) 0xFFFF0414)
#define          PLLKEY2                                    (*(volatile unsigned long      *) 0xFFFF0418)

// POWER SUPPLY MONITOR

#define          PSMBASE                                    (*(volatile unsigned long      *) 0xFFFF0440)
#define          PSMCON                                     (*(volatile unsigned long      *) 0xFFFF0440)
#define          CMPCON                                     (*(volatile unsigned long      *) 0xFFFF0444)

// Band Gap Reference

#define          REFBASE                                    (*(volatile unsigned long      *) 0xFFFF0480)
#define          REFCON                                     (*(volatile unsigned long      *) 0xFFFF048C)

// ADC INTERFACE REGISTERS

#define          ADCBASE                                    (*(volatile unsigned long      *) 0xFFFF0500)
#define          ADCCON                                     (*(volatile unsigned long      *) 0xFFFF0500)
#define          ADCCP                                      (*(volatile unsigned long      *) 0xFFFF0504)
#define          ADCCN                                      (*(volatile unsigned long      *) 0xFFFF0508)
#define          ADCSTA                                     (*(volatile unsigned long      *) 0xFFFF050C)
#define          ADCDAT                                     (*(volatile unsigned long      *) 0xFFFF0510)
#define          ADCRST                                     (*(volatile unsigned long      *) 0xFFFF0514)
#define          ADCGN                                      (*(volatile unsigned long      *) 0xFFFF0530)
#define          ADCOF                                      (*(volatile unsigned long      *) 0xFFFF0534)

// DAC INTERFACE REGISTERS

#define          DACBASE                                    (*(volatile unsigned long      *) 0xFFFF0670)
#define          DACCON                                     (*(volatile unsigned long      *) 0xFFFF0670)
#define          DACDAT                                     (*(volatile unsigned long      *) 0xFFFF06B4)

// DDS INTERFACE REGISTERS

#define          DDSBASE                                    (*(volatile unsigned long      *) 0xFFFF0690)
#define          DDSCON                                     (*(volatile unsigned long      *) 0xFFFF0690)
#define          DDSFRQ                                     (*(volatile unsigned long      *) 0xFFFF0694)
#define          DDSPHS                                     (*(volatile unsigned long      *) 0xFFFF0698)
#define          DACKEY0                                    (*(volatile unsigned long      *) 0xFFFF06A4)
#define          DACEN                                      (*(volatile unsigned long      *) 0xFFFF06B8)
#define          DACKEY1                                    (*(volatile unsigned long      *) 0xFFFF06BC)

// 450 COMPATIABLE UART 0 CORE REGISTERS

#define          UART0BASE                                  (*(volatile unsigned long      *) 0xFFFF0700)
#define          COM0TX                                     (*(volatile unsigned long      *) 0xFFFF0700)
#define          COM0RX                                     (*(volatile unsigned long      *) 0xFFFF0700)
#define          COM0DIV0                                   (*(volatile unsigned long      *) 0xFFFF0700)
#define          COM0IEN0                                   (*(volatile unsigned long      *) 0xFFFF0704)
#define          COM0DIV1                                   (*(volatile unsigned long      *) 0xFFFF0704)
#define          COM0IID0                                   (*(volatile unsigned long      *) 0xFFFF0708)
#define          COM0CON0                                   (*(volatile unsigned long      *) 0xFFFF070C)
#define          COM0CON1                                   (*(volatile unsigned long      *) 0xFFFF0710)
#define          COM0STA0                                   (*(volatile unsigned long      *) 0xFFFF0714)
#define          COM0STA1                                   (*(volatile unsigned long      *) 0xFFFF0718)
#define          COM0SCR                                    (*(volatile unsigned long      *) 0xFFFF071C)
#define          COM0IEN1                                   (*(volatile unsigned long      *) 0xFFFF0720)
#define          COM0IID1                                   (*(volatile unsigned long      *) 0xFFFF0724)
#define          COM0ADR                                    (*(volatile unsigned long      *) 0xFFFF0728)
#define          COM0DIV2                                   (*(volatile unsigned long      *) 0xFFFF072C)

// 450 COMPATIABLE UART 1 CORE REGISTERS

#define          UART1BASE                                  (*(volatile unsigned long      *) 0xFFFF0740)
#define          COM1TX                                     (*(volatile unsigned long      *) 0xFFFF0740)
#define          COM1RX                                     (*(volatile unsigned long      *) 0xFFFF0740)
#define          COM1DIV0                                   (*(volatile unsigned long      *) 0xFFFF0740)
#define          COM1IEN0                                   (*(volatile unsigned long      *) 0xFFFF0744)
#define          COM1DIV1                                   (*(volatile unsigned long      *) 0xFFFF0744)
#define          COM1IID0                                   (*(volatile unsigned long      *) 0xFFFF0748)
#define          COM1CON0                                   (*(volatile unsigned long      *) 0xFFFF074C)
#define          COM1CON1                                   (*(volatile unsigned long      *) 0xFFFF0750)
#define          COM1STA0                                   (*(volatile unsigned long      *) 0xFFFF0754)
#define          COM1STA1                                   (*(volatile unsigned long      *) 0xFFFF0758)
#define          COM1SCR                                    (*(volatile unsigned long      *) 0xFFFF075C)
#define          COM1IEN1                                   (*(volatile unsigned long      *) 0xFFFF0760)
#define          COM1IID1                                   (*(volatile unsigned long      *) 0xFFFF0764)
#define          COM1ADR                                    (*(volatile unsigned long      *) 0xFFFF0768)
#define          COM1DIV2                                   (*(volatile unsigned long      *) 0xFFFF076C)

