vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7128.h
// I2C BUS PERIPHERAL DEVICE 0

#define          I2C0BASE                                   (*(volatile unsigned long      *) 0xFFFF0800)
#define          I2C0MSTA                                   (*(volatile unsigned long      *) 0xFFFF0800)
#define          I2C0SSTA                                   (*(volatile unsigned long      *) 0xFFFF0804)
#define          I2C0SRX                                    (*(volatile unsigned long      *) 0xFFFF0808)
#define          I2C0STX                                    (*(volatile unsigned long      *) 0xFFFF080C)
#define          I2C0MRX                                    (*(volatile unsigned long      *) 0xFFFF0810)
#define          I2C0MTX                                    (*(volatile unsigned long      *) 0xFFFF0814)
#define          I2C0CNT                                    (*(volatile unsigned long      *) 0xFFFF0818)
#define          I2C0ADR                                    (*(volatile unsigned long      *) 0xFFFF081C)
#define          I2C0BYT                                    (*(volatile unsigned long      *) 0xFFFF0824)
#define          I2C0ALT                                    (*(volatile unsigned long      *) 0xFFFF0828)
#define          I2C0CFG                                    (*(volatile unsigned long      *) 0xFFFF082C)
#define          I2C0DIV                                    (*(volatile unsigned long      *) 0xFFFF0830)
#define          I2C0ID0                                    (*(volatile unsigned long      *) 0xFFFF0838)
#define          I2C0ID1                                    (*(volatile unsigned long      *) 0xFFFF083C)
#define          I2C0ID2                                    (*(volatile unsigned long      *) 0xFFFF0840)
#define          I2C0ID3                                    (*(volatile unsigned long      *) 0xFFFF0844)
#define          I2C0SSC                                    (*(volatile unsigned long      *) 0xFFFF0848)
#define          I2C0FIF                                    (*(volatile unsigned long      *) 0xFFFF084C)

// I2C BUS PERIPHERAL DEVICE 1

#define          I2C1BASE                                   (*(volatile unsigned long      *) 0xFFFF0900)
#define          I2C1MSTA                                   (*(volatile unsigned long      *) 0xFFFF0900)
#define          I2C1SSTA                                   (*(volatile unsigned long      *) 0xFFFF0904)
#define          I2C1SRX                                    (*(volatile unsigned long      *) 0xFFFF0908)
#define          I2C1STX                                    (*(volatile unsigned long      *) 0xFFFF090C)
#define          I2C1MRX                                    (*(volatile unsigned long      *) 0xFFFF0910)
#define          I2C1MTX                                    (*(volatile unsigned long      *) 0xFFFF0914)
#define          I2C1CNT                                    (*(volatile unsigned long      *) 0xFFFF0918)
#define          I2C1ADR                                    (*(volatile unsigned long      *) 0xFFFF091C)
#define          I2C1BYT                                    (*(volatile unsigned long      *) 0xFFFF0924)
#define          I2C1ALT                                    (*(volatile unsigned long      *) 0xFFFF0928)
#define          I2C1CFG                                    (*(volatile unsigned long      *) 0xFFFF092C)
#define          I2C1DIV                                    (*(volatile unsigned long      *) 0xFFFF0930)
#define          I2C1ID0                                    (*(volatile unsigned long      *) 0xFFFF0938)
#define          I2C1ID1                                    (*(volatile unsigned long      *) 0xFFFF093C)
#define          I2C1ID2                                    (*(volatile unsigned long      *) 0xFFFF0940)
#define          I2C1ID3                                    (*(volatile unsigned long      *) 0xFFFF0944)
#define          I2C1SSC                                    (*(volatile unsigned long      *) 0xFFFF0948)
#define          I2C1FIF                                    (*(volatile unsigned long      *) 0xFFFF094C)

// SERIAL PERIPHERAL INTERFACE

#define          SPIBASE                                    (*(volatile unsigned long      *) 0xFFFF0A00)
#define          SPISTA                                     (*(volatile unsigned long      *) 0xFFFF0A00)
#define          SPIRX                                      (*(volatile unsigned long      *) 0xFFFF0A04)
#define          SPITX                                      (*(volatile unsigned long      *) 0xFFFF0A08)
#define          SPIDIV                                     (*(volatile unsigned long      *) 0xFFFF0A0C)
#define          SPICON                                     (*(volatile unsigned long      *) 0xFFFF0A10)

// PROGRAMABLE LOGIC ARRAY

#define          PLABASE                                    (*(volatile unsigned long      *) 0xFFFF0B00)
#define          PLAELM0                                    (*(volatile unsigned long      *) 0xFFFF0B00)
#define          PLAELM1                                    (*(volatile unsigned long      *) 0xFFFF0B04)
#define          PLAELM2                                    (*(volatile unsigned long      *) 0xFFFF0B08)
#define          PLAELM3                                    (*(volatile unsigned long      *) 0xFFFF0B0C)
#define          PLAELM4                                    (*(volatile unsigned long      *) 0xFFFF0B10)
#define          PLAELM5                                    (*(volatile unsigned long      *) 0xFFFF0B14)
#define          PLAELM6                                    (*(volatile unsigned long      *) 0xFFFF0B18)
#define          PLAELM7                                    (*(volatile unsigned long      *) 0xFFFF0B1C)
#define          PLAELM8                                    (*(volatile unsigned long      *) 0xFFFF0B20)
#define          PLAELM9                                    (*(volatile unsigned long      *) 0xFFFF0B24)
#define          PLAELM10                                   (*(volatile unsigned long      *) 0xFFFF0B28)
#define          PLAELM11                                   (*(volatile unsigned long      *) 0xFFFF0B2C)
#define          PLAELM12                                   (*(volatile unsigned long      *) 0xFFFF0B30)
#define          PLAELM13                                   (*(volatile unsigned long      *) 0xFFFF0B34)
#define          PLAELM14                                   (*(volatile unsigned long      *) 0xFFFF0B38)
#define          PLAELM15                                   (*(volatile unsigned long      *) 0xFFFF0B3C)
#define          PLACLK                                     (*(volatile unsigned long      *) 0xFFFF0B40)
#define          PLAIRQ                                     (*(volatile unsigned long      *) 0xFFFF0B44)
#define          PLAADC                                     (*(volatile unsigned long      *) 0xFFFF0B48)
#define          PLADIN                                     (*(volatile unsigned long      *) 0xFFFF0B4C)
#define          PLAOUT                                     (*(volatile unsigned long      *) 0xFFFF0B50)

// External Port

#define          EPBASE                                     (*(volatile unsigned long      *) 0xFFFF0C00)
#define          XMCFG                                      (*(volatile unsigned long      *) 0xFFFF0C00)
#define          XM0CON                                     (*(volatile unsigned long      *) 0xFFFF0C10)
#define          XM1CON                                     (*(volatile unsigned long      *) 0xFFFF0C14)
#define          XM2CON                                     (*(volatile unsigned long      *) 0xFFFF0C18)
#define          XM3CON                                     (*(volatile unsigned long      *) 0xFFFF0C1C)
#define          XM0PAR                                     (*(volatile unsigned long      *) 0xFFFF0C20)
#define          XM1PAR                                     (*(volatile unsigned long      *) 0xFFFF0C24)
#define          XM2PAR                                     (*(volatile unsigned long      *) 0xFFFF0C28)
#define          XM3PAR                                     (*(volatile unsigned long      *) 0xFFFF0C2C)

// GPIO AND SERIAL PORT MUX

#define          GPIOBASE                                   (*(volatile unsigned long      *) 0xFFFF0D00)
#define          GP0CON                                     (*(volatile unsigned long      *) 0xFFFF0D00)
#define          GP1CON                                     (*(volatile unsigned long      *) 0xFFFF0D04)
#define          GP2CON                                     (*(volatile unsigned long      *) 0xFFFF0D08)
#define          GP3CON                                     (*(volatile unsigned long      *) 0xFFFF0D0C)
#define          GP4CON                                     (*(volatile unsigned long      *) 0xFFFF0D10)
#define          GP0DAT                                     (*(volatile unsigned long      *) 0xFFFF0D20)
#define          GP0SET                                     (*(volatile unsigned long      *) 0xFFFF0D24)
#define          GP0CLR                                     (*(volatile unsigned long      *) 0xFFFF0D28)
#define          GP0PAR                                     (*(volatile unsigned long      *) 0xFFFF0D2C)
#define          GP1DAT                                     (*(volatile unsigned long      *) 0xFFFF0D30)
#define          GP1SET                                     (*(volatile unsigned long      *) 0xFFFF0D34)
#define          GP1CLR                                     (*(volatile unsigned long      *) 0xFFFF0D38)
#define          GP1PAR                                     (*(volatile unsigned long      *) 0xFFFF0D3C)
#define          GP2DAT                                     (*(volatile unsigned long      *) 0xFFFF0D40)
#define          GP2SET                                     (*(volatile unsigned long      *) 0xFFFF0D44)
#define          GP2CLR                                     (*(volatile unsigned long      *) 0xFFFF0D48)
#define          GP3DAT                                     (*(volatile unsigned long      *) 0xFFFF0D50)
#define          GP3SET                                     (*(volatile unsigned long      *) 0xFFFF0D54)
#define          GP3CLR                                     (*(volatile unsigned long      *) 0xFFFF0D58)
#define          GP3PAR                                     (*(volatile unsigned long      *) 0xFFFF0D5C)
#define          GP4DAT                                     (*(volatile unsigned long      *) 0xFFFF0D60)
#define          GP4SET                                     (*(volatile unsigned long      *) 0xFFFF0D64)
#define          GP4CLR                                     (*(volatile unsigned long      *) 0xFFFF0D68)
#define          GP4PAR                                     (*(volatile unsigned long      *) 0xFFFF0D6C)

// FLASH CONTROL INTERFACE 0

#define          FLASH0BASE                                 (*(volatile unsigned long      *) 0xFFFF0E00)
#define          FEE0STA                                    (*(volatile unsigned long      *) 0xFFFF0E00)
#define          FEE0MOD                                    (*(volatile unsigned long      *) 0xFFFF0E04)
#define          FEE0CON                                    (*(volatile unsigned long      *) 0xFFFF0E08)
#define          FEE0DAT                                    (*(volatile unsigned long      *) 0xFFFF0E0C)
#define          FEE0ADR                                    (*(volatile unsigned long      *) 0xFFFF0E10)
#define          FEE0SGN                                    (*(volatile unsigned long      *) 0xFFFF0E18)
#define          FEE0PRO                                    (*(volatile unsigned long      *) 0xFFFF0E1C)
#define          FEE0HID                                    (*(volatile unsigned long      *) 0xFFFF0E20)

