vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7128.h
// FLASH CONTROL INTERFACE 1

#define          FLASH1BASE                                 (*(volatile unsigned long      *) 0xFFFF0E80)
#define          FEE1STA                                    (*(volatile unsigned long      *) 0xFFFF0E80)
#define          FEE1MOD                                    (*(volatile unsigned long      *) 0xFFFF0E84)
#define          FEE1CON                                    (*(volatile unsigned long      *) 0xFFFF0E88)
#define          FEE1DAT                                    (*(volatile unsigned long      *) 0xFFFF0E8C)
#define          FEE1ADR                                    (*(volatile unsigned long      *) 0xFFFF0E90)
#define          FEE1SGN                                    (*(volatile unsigned long      *) 0xFFFF0E98)
#define          FEE1PRO                                    (*(volatile unsigned long      *) 0xFFFF0E9C)
#define          FEE1HID                                    (*(volatile unsigned long      *) 0xFFFF0EA0)

// Quadrature Encoder

#define          QENBASE                                    (*(volatile unsigned long      *) 0xFFFF0F00)
#define          QENCON                                     (*(volatile unsigned long      *) 0xFFFF0F00)
#define          QENSTA                                     (*(volatile unsigned long      *) 0xFFFF0F04)
#define          QENDAT                                     (*(volatile unsigned long      *) 0xFFFF0F08)
#define          QENVAL                                     (*(volatile unsigned long      *) 0xFFFF0F0C)
#define          QENCLR                                     (*(volatile unsigned long      *) 0xFFFF0F14)
#define          QENSET                                     (*(volatile unsigned long      *) 0xFFFF0F18)

// Pulse Width Modulator

#define          PWMBASE                                    (*(volatile unsigned long      *) 0xFFFF0F80)
#define          PWMCON1                                    (*(volatile unsigned long      *) 0xFFFF0F80)
#define          PWM1COM1                                   (*(volatile unsigned long      *) 0xFFFF0F84)
#define          PWM1COM2                                   (*(volatile unsigned long      *) 0xFFFF0F88)
#define          PWM1COM3                                   (*(volatile unsigned long      *) 0xFFFF0F8C)
#define          PWM1LEN                                    (*(volatile unsigned long      *) 0xFFFF0F90)
#define          PWM2COM1                                   (*(volatile unsigned long      *) 0xFFFF0F94)
#define          PWM2COM2                                   (*(volatile unsigned long      *) 0xFFFF0F98)
#define          PWM2COM3                                   (*(volatile unsigned long      *) 0xFFFF0F9C)
#define          PWM2LEN                                    (*(volatile unsigned long      *) 0xFFFF0FA0)
#define          PWM3COM1                                   (*(volatile unsigned long      *) 0xFFFF0FA4)
#define          PWM3COM2                                   (*(volatile unsigned long      *) 0xFFFF0FA8)
#define          PWM3COM3                                   (*(volatile unsigned long      *) 0xFFFF0FAC)
#define          PWM3LEN                                    (*(volatile unsigned long      *) 0xFFFF0FB0)
#define          PWMCON2                                    (*(volatile unsigned long      *) 0xFFFF0FB4)
#define          PWMICLR                                    (*(volatile unsigned long      *) 0xFFFF0FB8)
/*    Function Pointers for Interrupts  */
typedef void (* tyVctHndlr) (void);

extern tyVctHndlr    IRQ;
extern tyVctHndlr    SWI;
extern tyVctHndlr    FIQ;
extern tyVctHndlr    UNDEF;
extern tyVctHndlr    PABORT;
extern tyVctHndlr    DABORT;
